Repository: abdelhaleemahmed/Arabic-os-learning-platform
Catalog: documentation/locales/*/LC_MESSAGES/user-guide/index.po
Languages: ar

source: User Guide
ar: دليل المستخدم

source: Welcome to the Arabic OS Platform User Guide. This comprehensive guide provides everything you need to understand and use our interactive learning tools for Arabic computing and operating system development.
ar: مرحباً بكم في دليل مستخدم منصة نظام التشغيل العربي. يوفر هذا الدليل الشامل كل ما تحتاجونه لفهم واستخدام أدوات التعلم التفاعلية الخاصة بنا للحوسبة العربية وتطوير أنظمة التشغيل.

source: What You'll Learn
ar: ما ستتعلمونه

source: Through our interactive tools and comprehensive documentation, you will master:
ar: من خلال أدواتنا التفاعلية والوثائق الشاملة، ستتقنون:

source: **Arabic Character Encoding** - Understanding CP1256, UTF-8, and Unicode systems
ar: **ترميز الأحرف العربية** - فهم أنظمة CP1256 و UTF-8 و Unicode

source: **Bidirectional Text Processing** - Complex text flow algorithms and implementation
ar: **معالجة النص ثنائي الاتجاه** - خوارزميات تدفق النص المعقدة والتنفيذ

source: **Operating System Internals** - Arabic text handling at the kernel level
ar: **أجزاء نظام التشغيل الداخلية** - التعامل مع النص العربي على مستوى النواة

source: **Typography and Rendering** - Advanced Arabic font rendering techniques
ar: **الطباعة والعرض** - تقنيات عرض الخطوط العربية المتقدمة

source: **Real-world Applications** - Practical Arabic computing solutions
ar: **التطبيقات الحقيقية** - حلول الحوسبة العربية العملية

source: Getting Started
ar: البدء

source: If you're new to Arabic computing, follow this recommended learning path:
ar: إذا كنتم جدد في الحوسبة العربية، اتبعوا مسار التعلم الموصى به هذا:

source: **Foundation**: Start with character encoding basics
ar: **الأساسيات**: ابدؤوا بأساسيات ترميز الأحرف

source: **Processing**: Learn text processing algorithms
ar: **المعالجة**: تعلموا خوارزميات معالجة النصوص

source: **Systems**: Explore operating system internals
ar: **الأنظمة**: استكشفوا أجزاء نظام التشغيل الداخلية

source: **Advanced**: Master typography and optimization
ar: **المتقدم**: أتقنوا الطباعة والتحسين

source: Interactive Learning Tools
ar: أدوات التعلم التفاعلية

source: Our platform features 8 comprehensive interactive tools:
ar: تتميز منصتنا بـ 8 أدوات تفاعلية شاملة:

source: Each tool provides hands-on experience with both theoretical concepts and practical implementation details.
ar: توفر كل أداة تجربة عملية مع المفاهيم النظرية وتفاصيل التنفيذ العملي.

source: Learning Objectives
ar: أهداف التعلم

source: By completing this user guide, you will be able to:
ar: بإتمام دليل المستخدم هذا، ستكونون قادرين على:

source: Understand how Arabic text is encoded and processed in different systems
ar: فهم كيفية ترميز ومعالجة النص العربي في الأنظمة المختلفة

source: Use interactive tools to explore character encoding and text processing
ar: استخدام الأدوات التفاعلية لاستكشاف ترميز الأحرف ومعالجة النصوص

source: Identify and solve common Arabic text display issues
ar: تحديد وحل مشاكل عرض النص العربي الشائعة

source: Appreciate the complexity of bidirectional text rendering
ar: تقدير تعقيد عرض النص ثنائي الاتجاه

source: Gain insights into operating system internals through Arabic-specific examples
ar: الحصول على رؤى حول أجزاء نظام التشغيل الداخلية من خلال أمثلة خاصة بالعربية

source: Support Resources
ar: موارد الدعم

source: Additional resources to support your learning:
ar: موارد إضافية لدعم تعلمكم:

source: :doc:`../tutorials/index` - Step-by-step guided tutorials
ar: :doc:`../tutorials/index` - دروس تعليمية تدريجية موجهة

source: :doc:`../reference/glossary` - Technical terms and definitions
ar: :doc:`../reference/glossary` - المصطلحات التقنية والتعريفات

source: :doc:`../reference/troubleshooting` - Common issues and solutions
ar: :doc:`../reference/troubleshooting` - المشاكل الشائعة والحلول
