Repository: abdelhaleemahmed/Arabic-os-learning-platform
Catalog: documentation/locales/*/LC_MESSAGES/user-guide/tools/index.po
Languages: ar

source: Interactive Learning Tools
ar: أدوات التعلم التفاعلية

source: The Arabic OS Platform features eight comprehensive interactive tools designed to provide hands-on experience with Arabic text processing, character encoding, and operating system concepts.
ar: تتميز منصة نظام التشغيل العربي بثماني أدوات تفاعلية شاملة مصممة لتوفير تجربة عملية مع معالجة النصوص العربية وترميز الأحرف ومفاهيم أنظمة التشغيل.

source: Tool Categories
ar: فئات الأدوات

source: Character Encoding Tools
ar: أدوات ترميز الأحرف

source: These tools help you understand how Arabic characters are represented and stored in computer systems.
ar: تساعدكم هذه الأدوات على فهم كيف يتم تمثيل وحفظ الأحرف العربية في أنظمة الحاسوب.

source: Text Processing Tools
ar: أدوات معالجة النصوص

source: Explore the complexities of bidirectional text and Arabic input methods.
ar: استكشفوا تعقيدات النص ثنائي الاتجاه وطرق إدخال العربية.

source: System-Level Tools
ar: أدوات مستوى النظام

source: Examine how Arabic text is handled at the operating system and hardware levels.
ar: افحصوا كيف يتم التعامل مع النص العربي على مستويات نظام التشغيل والعتاد.

source: Tool Features
ar: ميزات الأدوات

source: Each interactive tool provides:
ar: توفر كل أداة تفاعلية:

source: **Real-time Visualization** - See concepts in action as you interact
ar: **التصور في الوقت الفعلي** - شاهدوا المفاهيم في العمل أثناء التفاعل

source: **Step-by-step Guidance** - Built-in tutorials and explanations
ar: **الإرشاد خطوة بخطوة** - دروس تعليمية وشروحات مدمجة

source: **Practical Examples** - Real-world Arabic text samples and use cases
ar: **أمثلة عملية** - عينات نصوص عربية وحالات استخدام من العالم الحقيقي

source: **Educational Content** - Comprehensive background information
ar: **محتوى تعليمي** - معلومات خلفية شاملة

source: **Interactive Exercises** - Hands-on learning activities
ar: **تمارين تفاعلية** - أنشطة تعلم عملية

source: Getting Started
ar: البدء

source: **Recommended Learning Path:**
ar: **مسار التعلم الموصى به:**

source: Start with :doc:`cp1256-explorer` to understand character encoding basics
ar: ابدأوا بـ :doc:`cp1256-explorer` لفهم أساسيات ترميز الأحرف

source: Progress to :doc:`utf8-visualizer` for modern Unicode concepts
ar: تقدموا إلى :doc:`utf8-visualizer` لمفاهيم يونيكود الحديثة

source: Explore :doc:`bidi-demo` for text flow algorithms
ar: استكشفوا :doc:`bidi-demo` لخوارزميات تدفق النص

source: Continue with system-level tools for advanced topics
ar: تابعوا مع أدوات مستوى النظام للمواضيع المتقدمة

source: **Quick Access:**
ar: **الوصول السريع:**

source: Each tool can be accessed directly through the documentation or run independently in your web browser. No installation is required - all tools are web-based and run locally in your browser.
ar: يمكن الوصول إلى كل أداة مباشرة من خلال الوثائق أو تشغيلها بشكل مستقل في متصفح الويب. لا حاجة للتثبيت - جميع الأدوات مبنية على الويب وتعمل محلياً في متصفحكم.

source: Technical Requirements
ar: المتطلبات التقنية

source: **Minimum Requirements:** * Modern web browser (Chrome 80+, Firefox 75+, Safari 13+, Edge 80+) * JavaScript enabled * Internet connection for initial loading
ar: **الحد الأدنى من المتطلبات:** * متصفح ويب حديث (Chrome 80+، Firefox 75+، Safari 13+، Edge 80+) * JavaScript مفعل * اتصال إنترنت للتحميل الأولي

source: **Recommended:** * Desktop or laptop computer for optimal interaction * Arabic font support (included in most modern operating systems) * Screen resolution of 1024x768 or higher
ar: **موصى به:** * حاسوب مكتبي أو محمول للتفاعل الأمثل * دعم الخطوط العربية (متضمن في معظم أنظمة التشغيل الحديثة) * دقة شاشة 1024x768 أو أعلى
